<a href="https://colab.research.google.com/github/ricardosimplicio/PUC-Rio-MVP-Engenharia_de_Dados/blob/main/Exerc%C3%ADcio_BD_Aula_3_Ricardo_Simplicio.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Banco de Dados - Prof. Sérgio Lifschitz

---

## Exercícios da Aula 3: Continuação com a linguagem SQL DML (consultas)


---


ANTES de começar,  ❗ **não esquecer** ❗ de, antes de mais nada, SALVAR este notebook no ambiente COLAB no drive da tua própria conta GOOGLE.

## PASSO 1: Instalação e Configuração do PostgreSQL

Basta dar PLAY que o script abaixo instalará o SGBD PostgreSQL

In [ ]:
# %%capture
# Instalação do PostgreSQL
!sudo apt-get -y -qq update
!pip install sqlalchemy==2.0
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start
# Alterando a senha do usuário padrão 'postgres' para 'postgres'
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

Collecting sqlalchemy==2.0
  Downloading SQLAlchemy-2.0.0-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (2.7 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.7/2.7 MB 7.7 MB/s eta 0:00:00
Requirement already satisfied: typing-extensions>=4.2.0 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.10/dist-packages (from sqlalchemy==2.0) (3.0.3)
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 2.0.30
    Uninstalling SQLAlchemy-2.0.30:
      Successfully uninstalled SQLAlchemy-2.0.30
Successfully installed sqlalchemy-2.0.0
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78, <> line 15.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package logrotate.
(Reading database ... 121918 files and directories currently installed.)
Preparing to unpack .../00-logrotate_3.19.0-1ubuntu1.1_amd64.deb ...
Unpacking logrotate (3.19.0-1ubuntu1.1) ...
Selecting previously unselected package netbase.
Preparing to unpack .../01-netbase_6.3_all.deb ...
Unpacking netbase (6.3) ...
Selecting previously unselected package libcommon-sense-perl:amd64.
Preparing to unpack .../02-libcommon-sense-perl_3.75-2build1_amd64.deb ...
Unpacking libcommon-sense-perl:amd64 (3.75-2build1) ...
Selecting previously unselected package libjson-perl.
Preparing to unpack .../03-libjson-perl_4.04000-1_all.deb ...
Unpacking libjson-perl (4.04000-1) ...
Selecting previously unselected package libtypes-serialiser-perl.
Preparing to unpack .../04-libtypes-serialiser-perl_1.01-1_all.deb ...
Unpacking libtypes-serialiser-perl (1.01-1) ...
Selecting previously unselected package libjson-xs-perl.
Preparing to unpack .../05-libjson-xs-perl_4.030-1build3_amd64.deb ...
Unpacking libjson-xs-perl (4.030-1build3) ...
Preparing to unpack .../06-libpq-dev_14.12-0ubuntu0.22.04.1_amd64.deb ...
Unpacking libpq-dev (14.12-0ubuntu0.22.04.1) over (14.11-0ubuntu0.22.04.1) ...
Preparing to unpack .../07-libpq5_14.12-0ubuntu0.22.04.1_amd64.deb ...
Unpacking libpq5:amd64 (14.12-0ubuntu0.22.04.1) over (14.11-0ubuntu0.22.04.1) ...
Selecting previously unselected package postgresql-client-common.
Preparing to unpack .../08-postgresql-client-common_238_all.deb ...
Unpacking postgresql-client-common (238) ...
Selecting previously unselected package postgresql-client-14.
Preparing to unpack .../09-postgresql-client-14_14.12-0ubuntu0.22.04.1_amd64.deb ...
Unpacking postgresql-client-14 (14.12-0ubuntu0.22.04.1) ...
Selecting previously unselected package ssl-cert.
Preparing to unpack .../10-ssl-cert_1.1.2_all.deb ...
Unpacking ssl-cert (1.1.2) ...
Selecting previously unselected package postgresql-common.
Preparing to unpack .../11-postgresql-common_238_all.deb ...
Adding 'diversion of /usr/bin/pg_config to /usr/bin/pg_config.libpq-dev by postgresql-common'
Unpacking postgresql-common (238) ...
Selecting previously unselected package postgresql-14.
Preparing to unpack .../12-postgresql-14_14.12-0ubuntu0.22.04.1_amd64.deb ...
Unpacking postgresql-14 (14.12-0ubuntu0.22.04.1) ...
Selecting previously unselected package postgresql.
Preparing to unpack .../13-postgresql_14+238_all.deb ...
Unpacking postgresql (14+238) ...
Selecting previously unselected package sysstat.
Preparing to unpack .../14-sysstat_12.5.2-2ubuntu0.2_amd64.deb ...
Unpacking sysstat (12.5.2-2ubuntu0.2) ...
Setting up logrotate (3.19.0-1ubuntu1.1) ...
Created symlink /etc/systemd/system/timers.target.wants/logrotate.timer → /lib/systemd/system/logrotate.timer.
Setting up libpq5:amd64 (14.12-0ubuntu0.22.04.1) ...
Setting up libcommon-sense-perl:amd64 (3.75-2build1) ...
Setting up libpq-dev (14.12-0ubuntu0.22.04.1) ...
Setting up ssl-cert (1.1.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Setting up libtypes-serialiser-perl (1.01-1) ...
Setting up libjson-perl (4.04000-1) ...
Setting up netbase (6.3) ...
Setting up sysstat (12.5.2-2ubuntu0.2) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline

Creating config file /etc/default/sysstat with new version
update-alternatives: using /usr/bin/sar.sysstat to provide /usr/bin/sar (sar) in auto mode
Created symlink /etc/systemd/system/sysstat.service.wants/sysstat-collect.timer → /lib/systemd/system/sysstat-collect.timer.
Created symlink /etc/systemd/system/sysstat.service.wants/sysstat-summary.timer → /lib/systemd/system/sysstat-summary.timer.
Created symlink /etc/systemd/system/multi-user.target.wants/sysstat.service → /lib/systemd/system/sysstat.service.
Setting up postgresql-client-common (238) ...
Setting up libjson-xs-perl (4.030-1build3) ...
Setting up postgresql-client-14 (14.12-0ubuntu0.22.04.1) ...
update-alternatives: using /usr/share/postgresql/14/man/man1/psql.1.gz to provide /usr/share/man/man1/psql.1.gz (psql.1.gz) in auto mode
Setting up postgresql-common (238) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Adding user postgres to group ssl-cert

Creating config file /etc/postgresql-common/createcluster.conf with new version
Building PostgreSQL dictionaries from installed myspell/hunspell packages...
Removing obsolete dictionary files:
Created symlink /etc/systemd/system/multi-user.target.wants/postgresql.service → /lib/systemd/system/postgresql.service.
Setting up postgresql-14 (14.12-0ubuntu0.22.04.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78.)
debconf: falling back to frontend: Readline
Creating new PostgreSQL cluster 14/main ...
/usr/lib/postgresql/14/bin/initdb -D /var/lib/postgresql/14/main --auth-local peer --auth-host scram-sha-256 --no-instructions
The files belonging to this database system will be owned by user "postgres".
This user must also own the server process.

The database cluster will be initialized with locale "en_US.UTF-8".
The default database encoding has accordingly been set to "UTF8".
The default text search configuration will be set to "english".

Data page checksums are disabled.

fixing permissions on existing directory /var/lib/postgresql/14/main ... ok
creating subdirectories ... ok
selecting dynamic shared memory implementation ... posix
selecting default max_connections ... 100
selecting default shared_buffers ... 128MB
selecting default time zone ... Etc/UTC
creating configuration files ... ok
running bootstrap script ... ok
performing post-bootstrap initialization ... ok
syncing data to disk ... ok
update-alternatives: using /usr/share/postgresql/14/man/man1/postmaster.1.gz to provide /usr/share/man/man1/postmaster.1.gz (postmaster.1.gz) in auto mode
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql (14+238) ...
Processing triggers for man-db (2.10.2-1) ...
Processing triggers for libc-bin (2.35-0ubuntu3.4) ...
/sbin/ldconfig.real: /usr/local/lib/libtbb.so.12 is not a symbolic link

/sbin/ldconfig.real: /usr/local/lib/libtbbbind_2_0.so.3 is not a symbolic link

/sbin/ldconfig.real: /usr/local/lib/libtbbmalloc.so.2 is not a symbolic link

/sbin/ldconfig.real: /usr/local/lib/libtbbbind.so.3 is not a symbolic link

/sbin/ldconfig.real: /usr/local/lib/libtbbmalloc_proxy.so.2 is not a symbolic link

/sbin/ldconfig.real: /usr/local/lib/libtbbbind_2_5.so.3 is not a symbolic link

 * Starting PostgreSQL 14 database server
   ...done.
ALTER ROLE

## PASSO 2: Preparo do Esquema Relacional EMPRESA

Baixe o esquema e instância de teste do BD EMPRESA neste link: https://drive.google.com/file/d/1zFlLaVJIWZokadeKWICYrWhTW_I2o_Bj/view?usp=sharing

❗Coloque o arquivo baixado *.SQL na **pasta padrão do seu Google Drive** ❗

Em seguida, é só dar PLAY (nas duas células seguintes!) pois os scripts (programas) abaixo preparam o ambiente para realizar consultas SQL no esquema de BD EMPRESA no seu próprio COLAB.

In [ ]:
# [2.1] Monta o diretório do Google Drive no seu Colab
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
# [2.2] Cria o esquema no banco de dados EMPRESA no Colab
%%capture
!sudo -u postgres psql -U postgres -c 'DROP SCHEMA IF EXISTS empresa CASCADE;'
!sudo -u postgres psql -U postgres -c 'CREATE SCHEMA empresa;'
!PGPASSWORD='postgres' psql -h localhost -U postgres -d postgres -a -f drive/MyDrive/esquema_empresa.sql

## PASSO 3: Preparando para usar o SGBD PostgreSQL localmente

Mais uma vez, é só dar PLAY (nas duas células seguintes!)

In [ ]:
# Configurando o PostgreSQL na variável de ambiente DATABASE_URL
%env DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

env: DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

In [ ]:
# Carregando a extensão sql para usar o SQL pelo Google Colab
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## **Lista de Exercícios**

Prática de SQL sobre o esquema EMPRESA implantado no SGBD PostgreSQL, já considerando a sintaxe completa após as 3 aulas do módulo "Banco de Dados"

### Esquema relacional da **base de dados Empresa**:

Seja o esquema relacional da base de dados simplificada de uma EMPRESA genérica. As chaves primárias (PK) respectivas estão sublinhadas e as chaves estrangeiras em itálico

<img src='https://drive.google.com/uc?id=1JWCG8paO9ksU-22L79Qmnkb4iYAHnlOy'>

A empresa é organizada em departamentos, cada qual tendo um nome, um número de identificação e um empregado (gerente) responsável pelo mesmo. Guarda-se como informação a data a partir da qual o empregado assumiu a gerência do departamento. Um departamento pode estar presente em diversas localidades do país.

Um departamento controla um certo número de projetos, e cada projeto tem um nome, um número de identificação e uma localidade única. Os departamentos têm vários empregados, para os quais guarda-se os respectivos nomes, número de identificação (Ident) na empresa, endereço (End) residencial, sexo, data de nascimento e salário (sal) em reais. Todo empregado tem um empregado que é seu superior hierárquico (supervisor direto - SuperIdent) dentro do departamento, informação que também deve ser mantida no banco de dados.

Um empregado é alocado a um único departamento mas pode trabalhar em mais de um projeto, estes não necessariamente controlados pelo departamento ao qual ele pertence. Controla-se o total de horas semanais (HRS) em que um empregado trabalha em cada projeto.

Para fim de controle de seguro de saúde de cada empregado, deve-se manter informações dos nomes, sexo, data de nascimento e grau de parentesco de seus dependentes. Estes são identificados por seu nome mas, também, pela identidade do empregado do qual dependem.

As restrições de integridade referenciais são: o atributo SuperIdent é chave estrangeira (FK) referenciando a PK da própria tabela EMPREGADO, da mesma forma que IdentGer em DEPARTAMENTO e IdentEmp em TRABALHA_NO e DEPENDENTE. DepNum é FK para a PK Num em DEPARTAMENTO em 3 tabelas: Empregado, Projeto e DepLoc. Por fim, ProjNum é FK em TRABALHA_NO referenciando a PK Num em PROJETO.

**ATENÇÃO:** deve-se dar play na próxima célula sempre que for usar o esquema EMPRESA!

In [ ]:
# Ativando o esquema empresa
%%sql
SET SCHEMA 'empresa';

Done.

[]

### **CRIANDO AS TABELAS - RS**

In [ ]:
%%sql

CREATE TABLE EMPRESA.DEPARTAMENTO(
NUM         VARCHAR(6) NOT NULL,
NOME        VARCHAR(50) NOT NULL,
IDENTGER    VARCHAR(50) NOT NULL,
DATAINI     VARCHAR(10) NOT NULL,

CONSTRAINT PK_NUM PRIMARY KEY (NUM)

);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

CREATE TABLE EMPRESA.Empregado(
IDENT       VARCHAR(20) NOT NULL,
NOME        VARCHAR(50) NOT NULL,
SAL         FLOAT(10) NOT NULL,
ENDER       VARCHAR(50) NOT NULL,
SEXO        VARCHAR(1),
DATANASC    VARCHAR(10) NOT NULL,
DEPNUM      VARCHAR(6) NOT NULL,
SUPERINDET  VARCHAR(50) NOT NULL,

CONSTRAINT PK_IDENT PRIMARY KEY (IDENT),
CONSTRAINT FK_DEPNUM FOREIGN KEY (DEPNUM) REFERENCES DEPARTAMENTO(NUM)

);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

CREATE TABLE EMPRESA.PROJETO(
NUM       VARCHAR(6) NOT NULL,
NOME      VARCHAR(50) NOT NULL,
LOCAL     VARCHAR(70) NOT NULL,
DEPNUM    VARCHAR(6) NOT NULL,

CONSTRAINT PK_NUM_PROJ PRIMARY KEY (NUM),
CONSTRAINT FK_DEPNUM FOREIGN KEY (DEPNUM) REFERENCES DEPARTAMENTO(NUM)

);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

CREATE TABLE EMPRESA.TRABALHANDO(
IDENTEMP    VARCHAR(20) NOT NULL,
PROJNUM     VARCHAR(6) NOT NULL,
HRS         VARCHAR(6) NOT NULL,

CONSTRAINT FK_IDENTEMP FOREIGN KEY (IDENTEMP) REFERENCES EMPREGADO(IDENT),
CONSTRAINT PK_PROJNUM FOREIGN KEY (PROJNUM) REFERENCES PROJETO(NUM)

);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

CREATE TABLE EMPRESA.DEPENDENTE(
    IDENTEMP    VARCHAR(20) NOT NULL,
    NOME        VARCHAR(50) NOT NULL,
    SEXO        VARCHAR(1) NOT NULL,
    DATANASC    VARCHAR(10) NOT NULL,
    PARENTESCO  VARCHAR(10) NOT NULL,
    CONSTRAINT FK_IDENTEMP_DEP FOREIGN KEY (IDENTEMP) REFERENCES EMPREGADO(IDENT),
    CONSTRAINT PK_DEPENDENTE PRIMARY KEY (IDENTEMP, NOME)
);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

CREATE TABLE EMPRESA.DEPLOCAL(
    DEPNUM    VARCHAR(6) NOT NULL,
    LOCAL     VARCHAR(70) NOT NULL,

    CONSTRAINT FK_DEPNUM_DEPLOCAL FOREIGN KEY (DEPNUM) REFERENCES DEPARTAMENTO(NUM)

);

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

**Consulta exemplo:** Quais empregados trabalham no Departamento de Informática?

### **INSERINDO DADOS**

In [ ]:

%%sql

TRUNCATE TABLE empresa.departamento,
                empresa.empregado,
                empresa.projeto,
                empresa.trabalhando,
                empresa.dependente,
                empresa.deplocal
RESTART IDENTITY CASCADE;

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [ ]:
%%sql

INSERT INTO
DEPARTAMENTO
Values
('1.234','Recursos Humanos','Maria Souza','01/01/2015'),
('2.345','Tecnologia da Informação','Carlos Santana','15/03/2016'),
('3.456','Finanças','João da Silva','22/05/2017'),
('4.567','Marketing','Ana Pereira','10/07/2018'),
('5.678','Vendas','Beatriz Oliveira','25/09/2019'),
('6.789','Produção','Daniela Costa','03/11/2020'),
('7.890','Pesquisa e Desenvolvimento','Eduardo Santos','14/01/2021'),
('8.901','Logística','Fernanda Lima','28/02/2022'),
('9.012','Compras','Gustavo Almeida','05/04/2023'),
('10.123','Atendimento ao Cliente','Helena Ferreira','18/06/2015'),
('11.234','Jurídico','Igor Mendes','22/08/2016'),
('12.345','Administração','Juliana Martins','30/10/2017'),
('13.456','Qualidade','Leonardo Rodrigues','17/12/2018'),
('14.567','Planejamento','Mariana Gomes','01/02/2019'),
('15.678','Suprimentos','Nelson Barros','20/03/2020')

;

 * postgresql://postgres:***@localhost:5432/postgres
15 rows affected.

[]

In [ ]:
%%sql

INSERT INTO
EMPREGADO
Values
('123.456.789','João da Silva','5000','Rua A, 123, Bairro Centro','M','01/01/1980','1.234','Maria de Souza'),
('987.654.321','Ana Pereira','4500','Av. B, 456, Bairro Norte','F','12/02/1985','2.345','Carlos Santana'),
('456.123.789','Carlos Andrade','6200','Rua C, 789, Bairro Sul','M','23/03/1975','3.456','João da Silva'),
('789.321.654','Beatriz Oliveira','3800','Av. D, 101, Bairro Leste','F','04/04/1990','4.567','Ana Pereira'),
('321.654.987','Daniela Costa','5300','Rua E, 202, Bairro Oeste','F','15/05/1982','5.678','Carlos Andrade'),
('654.987.123','Eduardo Santos','4200','Av. F, 303, Bairro Centro','M','26/06/1988','6.789','Beatriz Oliveira'),
('159.753.486','Fernanda Lima','5600','Rua G, 404, Bairro Norte','F','07/07/1979','7.890','Daniela Costa'),
('753.159.864','Gustavo Almeida','4700','Av. H, 505, Bairro Sul','M','18/08/1986','8.901','Eduardo Santos'),
('864.975.312','Helena Ferreira','6000','Rua I, 606, Bairro Leste','F','29/09/1983','9.012','Fernanda Lima'),
('312.864.975','Igor Mendes','3900','Av. J, 707, Bairro Oeste','M','10/10/1991','10.123','Gustavo Almeida'),
('975.312.864','Juliana Martins','4800','Rua K, 808, Bairro Centro','F','21/11/1987','11.234','Helena Ferreira'),
('486.159.753','Leonardo Rodrigues','5100','Av. L, 909, Bairro Norte','M','02/12/1981','12.345','Igor Mendes'),
('531.642.879','Mariana Gomes','4300','Rua M, 110, Bairro Sul','F','13/01/1989','13.456','Juliana Martins'),
('642.879.531','Nelson Barros','6500','Av. N, 211, Bairro Leste','M','24/02/1978','14.567','Leonardo Rodrigues'),
('879.531.642','Olivia Azevedo','4600','Rua O, 312, Bairro Oeste','F','05/03/1992','15.678','Mariana Gomes')

;

 * postgresql://postgres:***@localhost:5432/postgres
15 rows affected.

[]

In [ ]:
%%sql

INSERT INTO
PROJETO
Values
('1','Projeto Alfa','São Paulo, SP','1.234'),
('2','Projeto Beta','Rio de Janeiro, RJ','2.345'),
('3','Projeto Gama','Belo Horizonte, MG','3.456'),
('4','Projeto Delta','Porto Alegre, RS','4.567'),
('5','Projeto Epsilon','Curitiba, PR','5.678'),
('6','Projeto Zeta','Salvador, BA','6.789'),
('7','Projeto Eta','Brasília, DF','7.890'),
('8','Projeto Theta','Fortaleza, CE','8.901'),
('9','Projeto Iota','Manaus, AM','9.012'),
('10','Projeto Kappa','Recife, PE','10.123'),
('11','Projeto Lambda','Goiânia, GO','11.234'),
('12','Projeto Mu','Florianópolis, SC','12.345'),
('13','Projeto Nu','Vitória, ES','13.456'),
('14','Projeto Xi','João Pessoa, PB','14.567'),
('15','Projeto Omicron','Maceió, AL','15.678'),
('16','Projeto Pi','Teresina, PI','1.234'),
('17','Projeto Rho','São Luís, MA','2.345'),
('18','Projeto Sigma','Natal, RN','3.456'),
('19','Projeto Tau','Campo Grande, MS','4.567'),
('20','Projeto Upsilon','Aracaju, SE','5.678'),
('21','Projeto Phi','Palmas, TO','6.789'),
('22','Projeto Chi','Boa Vista, RR','7.890'),
('23','Projeto Psi','Macapá, AP','8.901'),
('24','Projeto Omega','Rio Branco, AC','9.012'),
('25','Projeto Alpha','Porto Velho, RO','10.123'),
('26','Projeto Beta','São Paulo, SP','11.234'),
('27','Projeto Gamma','Belo Horizonte, MG','12.345'),
('28','Projeto Delta','Porto Alegre, RS','13.456'),
('29','Projeto Epsilon','Curitiba, PR','14.567'),
('30','Projeto Zeta','Salvador, BA','15.678')

;

 * postgresql://postgres:***@localhost:5432/postgres
30 rows affected.

[]

In [ ]:
%%sql

INSERT INTO
TRABALHANDO
Values
('123.456.789','1','40.0'),
('987.654.321','2','35.5'),
('456.123.789','3','42.0'),
('789.321.654','4','38.0'),
('321.654.987','5','36.0'),
('654.987.123','6','39.5'),
('159.753.486','7','41.0'),
('753.159.864','8','37.0'),
('864.975.312','9','43.0'),
('312.864.975','10','34.5'),
('975.312.864','11','40.0'),
('486.159.753','12','42.5')


;

 * postgresql://postgres:***@localhost:5432/postgres
12 rows affected.

[]

In [ ]:
%%sql

INSERT INTO
DEPENDENTE
Values
('975.312.864','Gabriel Martins','M','12/03/2011','Filho'),
('486.159.753','Julia Rodrigues','F','15/06/2013','Filha'),
('531.642.879','Leonardo Gomes','M','28/07/2009','Filho'),
('642.879.531','Mariana Barros','F','21/05/2007','Filha'),
('879.531.642','Felipe Azevedo','M','02/01/2010','Filho'),
('123.456.789','Isabella da Silva','F','18/12/2012','Filha'),
('987.654.321','Matheus Pereira','M','07/09/2008','Filho'),
('456.123.789','Amanda Andrade','F','14/11/2005','Filha'),
('789.321.654','Rafael Oliveira','M','23/04/2011','Filho'),
('321.654.987','Carolina Costa','F','29/08/2006','Filha')
;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[]

In [ ]:
%%sql

INSERT INTO
DEPLOCAL
Values
('1.234','São Paulo, SP'),
('2.345','Rio de Janeiro, RJ'),
('3.456','Belo Horizonte, MG'),
('4.567','Porto Alegre, RS'),
('5.678','Curitiba, PR'),
('6.789','Salvador, BA'),
('7.890','Brasília, DF'),
('8.901','Fortaleza, CE'),
('9.012','Manaus, AM'),
('10.123','Recife, PE'),
('11.234','Goiânia, GO'),
('12.345','Florianópolis, SC'),
('13.456','Vitória, ES'),
('14.567','João Pessoa, PB'),
('15.678','Maceió, AL')

;

 * postgresql://postgres:***@localhost:5432/postgres
15 rows affected.

[]

In [ ]:
# Para rodar a consulta em SQL abaixo, basta dar PLAY nesta célula!

# Se quiser, pode mudar o departamento e verificar as respostas
# (instâncias!) distintas. Para isso consultar quais departamentos
# existem na tabela Departamento desta instância exemplo.

# Atenção ao uso de acentos, maiúsculas e minúsculas: para SQL e para atributos
# das relações não faz diferença. Entretando, para valores sim! Se tivesse usado
# "informática" com acento ou tudo minúsculo teria retornado uma tabela vazia.

%%sql

SELECT ident as IDENTIDADE, nome as NOME_EMPREGADO
FROM   empregado
WHERE  depnum in (SELECT num
                  FROM departamento
                  WHERE nome = 'Tecnologia da Informação')

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('987.654.321', 'Ana Pereira')]

### 1. Listar todos os Números dos projetos e os respectivos Números de departamentos que os controlam.

In [ ]:
%%sql

SELECT num, depnum
from projeto;

 * postgresql://postgres:***@localhost:5432/postgres
30 rows affected.

[('1', '1.234'),
 ('2', '2.345'),
 ('3', '3.456'),
 ('4', '4.567'),
 ('5', '5.678'),
 ('6', '6.789'),
 ('7', '7.890'),
 ('8', '8.901'),
 ('9', '9.012'),
 ('10', '10.123'),
 ('11', '11.234'),
 ('12', '12.345'),
 ('13', '13.456'),
 ('14', '14.567'),
 ('15', '15.678'),
 ('16', '1.234'),
 ('17', '2.345'),
 ('18', '3.456'),
 ('19', '4.567'),
 ('20', '5.678'),
 ('21', '6.789'),
 ('22', '7.890'),
 ('23', '8.901'),
 ('24', '9.012'),
 ('25', '10.123'),
 ('26', '11.234'),
 ('27', '12.345'),
 ('28', '13.456'),
 ('29', '14.567'),
 ('30', '15.678')]

### 2 Listar todos os Números e Nomes dos projetos, e os respectivos Números e Nomes de departamentos que os controlam.

In [ ]:
%%sql

select projeto.num, projeto.nome, projeto.depnum, departamento.num, departamento.nome
from projeto
inner join departamento on departamento.num = projeto.depnum;

 * postgresql://postgres:***@localhost:5432/postgres
30 rows affected.

[('1', 'Projeto Alfa', '1.234', '1.234', 'Recursos Humanos'),
 ('2', 'Projeto Beta', '2.345', '2.345', 'Tecnologia da Informação'),
 ('3', 'Projeto Gama', '3.456', '3.456', 'Finanças'),
 ('4', 'Projeto Delta', '4.567', '4.567', 'Marketing'),
 ('5', 'Projeto Epsilon', '5.678', '5.678', 'Vendas'),
 ('6', 'Projeto Zeta', '6.789', '6.789', 'Produção'),
 ('7', 'Projeto Eta', '7.890', '7.890', 'Pesquisa e Desenvolvimento'),
 ('8', 'Projeto Theta', '8.901', '8.901', 'Logística'),
 ('9', 'Projeto Iota', '9.012', '9.012', 'Compras'),
 ('10', 'Projeto Kappa', '10.123', '10.123', 'Atendimento ao Cliente'),
 ('11', 'Projeto Lambda', '11.234', '11.234', 'Jurídico'),
 ('12', 'Projeto Mu', '12.345', '12.345', 'Administração'),
 ('13', 'Projeto Nu', '13.456', '13.456', 'Qualidade'),
 ('14', 'Projeto Xi', '14.567', '14.567', 'Planejamento'),
 ('15', 'Projeto Omicron', '15.678', '15.678', 'Suprimentos'),
 ('16', 'Projeto Pi', '1.234', '1.234', 'Recursos Humanos'),
 ('17', 'Projeto Rho', '2.345', '2.345', 'Tecnologia da Informação'),
 ('18', 'Projeto Sigma', '3.456', '3.456', 'Finanças'),
 ('19', 'Projeto Tau', '4.567', '4.567', 'Marketing'),
 ('20', 'Projeto Upsilon', '5.678', '5.678', 'Vendas'),
 ('21', 'Projeto Phi', '6.789', '6.789', 'Produção'),
 ('22', 'Projeto Chi', '7.890', '7.890', 'Pesquisa e Desenvolvimento'),
 ('23', 'Projeto Psi', '8.901', '8.901', 'Logística'),
 ('24', 'Projeto Omega', '9.012', '9.012', 'Compras'),
 ('25', 'Projeto Alpha', '10.123', '10.123', 'Atendimento ao Cliente'),
 ('26', 'Projeto Beta', '11.234', '11.234', 'Jurídico'),
 ('27', 'Projeto Gamma', '12.345', '12.345', 'Administração'),
 ('28', 'Projeto Delta', '13.456', '13.456', 'Qualidade'),
 ('29', 'Projeto Epsilon', '14.567', '14.567', 'Planejamento'),
 ('30', 'Projeto Zeta', '15.678', '15.678', 'Suprimentos')]

### 3. Exibir o nome e grau de parentesco dos dependentes juntamente com a identidade e nome dos empregados dos quais dependem.

In [ ]:
%%sql

select dependente.nome as Nome_Dependente, dependente.parentesco, dependente.identemp as Identidado_empregado, empregado.nome as nome_do_empregado
from Dependente
inner join empregado on empregado.ident = dependente.identemp;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('Gabriel Martins', 'Filho', '975.312.864', 'Juliana Martins'),
 ('Julia Rodrigues', 'Filha', '486.159.753', 'Leonardo Rodrigues'),
 ('Leonardo Gomes', 'Filho', '531.642.879', 'Mariana Gomes'),
 ('Mariana Barros', 'Filha', '642.879.531', 'Nelson Barros'),
 ('Felipe Azevedo', 'Filho', '879.531.642', 'Olivia Azevedo'),
 ('Isabella da Silva', 'Filha', '123.456.789', 'João da Silva'),
 ('Matheus Pereira', 'Filho', '987.654.321', 'Ana Pereira'),
 ('Amanda Andrade', 'Filha', '456.123.789', 'Carlos Andrade'),
 ('Rafael Oliveira', 'Filho', '789.321.654', 'Beatriz Oliveira'),
 ('Carolina Costa', 'Filha', '321.654.987', 'Daniela Costa')]

### 4. Para cada empregado, mostrar seu nome e sexo, e a identidade e nome do seu superior imediato.

In [ ]:
%%sql

select E.nome as nome_empregado, E.sexo, S.SUPERINDET as NOME_SUPERIOR, S.IDENT AS IDENTIDADE_SUPERIOR
from empregado AS E
INNER JOIN EMPREGADO AS S ON E.NOME = S.SUPERINDET;

 * postgresql://postgres:***@localhost:5432/postgres
13 rows affected.

[('João da Silva', 'M', 'João da Silva', '456.123.789'),
 ('Ana Pereira', 'F', 'Ana Pereira', '789.321.654'),
 ('Carlos Andrade', 'M', 'Carlos Andrade', '321.654.987'),
 ('Beatriz Oliveira', 'F', 'Beatriz Oliveira', '654.987.123'),
 ('Daniela Costa', 'F', 'Daniela Costa', '159.753.486'),
 ('Eduardo Santos', 'M', 'Eduardo Santos', '753.159.864'),
 ('Fernanda Lima', 'F', 'Fernanda Lima', '864.975.312'),
 ('Gustavo Almeida', 'M', 'Gustavo Almeida', '312.864.975'),
 ('Helena Ferreira', 'F', 'Helena Ferreira', '975.312.864'),
 ('Igor Mendes', 'M', 'Igor Mendes', '486.159.753'),
 ('Juliana Martins', 'F', 'Juliana Martins', '531.642.879'),
 ('Leonardo Rodrigues', 'M', 'Leonardo Rodrigues', '642.879.531'),
 ('Mariana Gomes', 'F', 'Mariana Gomes', '879.531.642')]

### 5. Listar os diferentes valores de salários pagos aos empregados da empresa.

In [ ]:
%%sql

SELECT DISTINCT SAL
FROM EMPREGADO;

 * postgresql://postgres:***@localhost:5432/postgres
15 rows affected.

[(5300.0,),
 (6200.0,),
 (5000.0,),
 (5100.0,),
 (4300.0,),
 (3900.0,),
 (4600.0,),
 (4500.0,),
 (4200.0,),
 (6000.0,),
 (5600.0,),
 (4800.0,),
 (4700.0,),
 (6500.0,),
 (3800.0,)]

In [ ]:
%%sql

SELECT *
FROM TRABALHANDO;

 * postgresql://postgres:***@localhost:5432/postgres
12 rows affected.

[('123.456.789', '1', '40.0'),
 ('987.654.321', '2', '35.5'),
 ('456.123.789', '3', '42.0'),
 ('789.321.654', '4', '38.0'),
 ('321.654.987', '5', '36.0'),
 ('654.987.123', '6', '39.5'),
 ('159.753.486', '7', '41.0'),
 ('753.159.864', '8', '37.0'),
 ('864.975.312', '9', '43.0'),
 ('312.864.975', '10', '34.5'),
 ('975.312.864', '11', '40.0'),
 ('486.159.753', '12', '42.5')]

In [ ]:
%%sql

SELECT column_name
FROM information_schema.columns
WHERE table_name = 'TRABALHANDO' ;

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.

[]

### 6. Quais os nomes dos empregados que trabalham menos de 20 horas por semana em algum projeto?

In [ ]:
%%sql

SELECT E.NOME, T.HRS
FROM EMPREGADO AS E
INNER JOIN TRABALHANDO AS T ON E.IDENT = T.IDENTEMP
WHERE T.HRS < '40';

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[('Ana Pereira', '35.5'),
 ('Beatriz Oliveira', '38.0'),
 ('Daniela Costa', '36.0'),
 ('Eduardo Santos', '39.5'),
 ('Gustavo Almeida', '37.0'),
 ('Igor Mendes', '34.5')]

### 7. Apresentar os nomes de todos os empregados que não têm dependentes.

In [ ]:
%%sql

select *

from dependente;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('975.312.864', 'Gabriel Martins', 'M', '12/03/2011', 'Filho'),
 ('486.159.753', 'Julia Rodrigues', 'F', '15/06/2013', 'Filha'),
 ('531.642.879', 'Leonardo Gomes', 'M', '28/07/2009', 'Filho'),
 ('642.879.531', 'Mariana Barros', 'F', '21/05/2007', 'Filha'),
 ('879.531.642', 'Felipe Azevedo', 'M', '02/01/2010', 'Filho'),
 ('123.456.789', 'Isabella da Silva', 'F', '18/12/2012', 'Filha'),
 ('987.654.321', 'Matheus Pereira', 'M', '07/09/2008', 'Filho'),
 ('456.123.789', 'Amanda Andrade', 'F', '14/11/2005', 'Filha'),
 ('789.321.654', 'Rafael Oliveira', 'M', '23/04/2011', 'Filho'),
 ('321.654.987', 'Carolina Costa', 'F', '29/08/2006', 'Filha')]

In [ ]:
# prompt:

%%sql

SELECT E.nome, d.identemp
FROM empregado AS E
LEFT JOIN dependente AS D ON E.ident = D.identemp
WHERE D.identemp IS NULL;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Eduardo Santos', None),
 ('Fernanda Lima', None),
 ('Gustavo Almeida', None),
 ('Helena Ferreira', None),
 ('Igor Mendes', None)]

### 8. Quais empregados tem cargos de chefia, isto é, não têm superior imediato?

In [ ]:
%%sql

select e.nome, d.identger
from empregado as e
inner join departamento as d on e.nome = d.identger;

 * postgresql://postgres:***@localhost:5432/postgres
13 rows affected.

[('João da Silva', 'João da Silva'),
 ('Ana Pereira', 'Ana Pereira'),
 ('Beatriz Oliveira', 'Beatriz Oliveira'),
 ('Daniela Costa', 'Daniela Costa'),
 ('Eduardo Santos', 'Eduardo Santos'),
 ('Fernanda Lima', 'Fernanda Lima'),
 ('Gustavo Almeida', 'Gustavo Almeida'),
 ('Helena Ferreira', 'Helena Ferreira'),
 ('Igor Mendes', 'Igor Mendes'),
 ('Juliana Martins', 'Juliana Martins'),
 ('Leonardo Rodrigues', 'Leonardo Rodrigues'),
 ('Mariana Gomes', 'Mariana Gomes'),
 ('Nelson Barros', 'Nelson Barros')]

### 9. Listar todos os locais onde se encontram departamentos da empresa ou onde são realizados projetos.

In [ ]:
%%sql

select local from deplocal
union
select local from projeto;

 * postgresql://postgres:***@localhost:5432/postgres
25 rows affected.

[('Porto Velho, RO',),
 ('Campo Grande, MS',),
 ('Fortaleza, CE',),
 ('Salvador, BA',),
 ('Rio Branco, AC',),
 ('Goiânia, GO',),
 ('Recife, PE',),
 ('Vitória, ES',),
 ('João Pessoa, PB',),
 ('Palmas, TO',),
 ('Florianópolis, SC',),
 ('Rio de Janeiro, RJ',),
 ('Brasília, DF',),
 ('Maceió, AL',),
 ('Boa Vista, RR',),
 ('Manaus, AM',),
 ('São Paulo, SP',),
 ('Macapá, AP',),
 ('Teresina, PI',),
 ('Aracaju, SE',),
 ('Natal, RN',),
 ('São Luís, MA',),
 ('Porto Alegre, RS',),
 ('Curitiba, PR',),
 ('Belo Horizonte, MG',)]

### 10. Apresentar o resultado dos salários dos empregados que trabalham no projeto “Reengenharia” caso fosse dado um aumento de 10%.

In [ ]:
%%sql

select e.sal * 1.1 as sal10, d.Num, p.nome
from empregado as e
inner join departamento as d on e.depnum = d.Num
inner join projeto as p on d.Num = p.depnum
where p.depnum = '1.234';

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.

[(5500.0, '1.234', 'Projeto Alfa'), (5500.0, '1.234', 'Projeto Pi')]

In [ ]:
%%sql

select p.nome, p.depnum, e.nome as Nome_Empregado, e.sal * 1.1 as "Salario+10%"
from projeto as p
inner join empregado as e on p.depnum = e.depnum
where p.nome = 'Projeto Gama';

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('Projeto Gama', '3.456', 'Carlos Andrade', 6820.000000000001)]

### 11. Quais os nomes dos empregados e os números de departamento dos quais eles são gerentes, se o forem?

In [ ]:
%%sql

select e.nome, d.num as "Número do Departamento", d.nome as "Nome do Departamento"
from empregado as e
inner join departamento as d on e.nome = d.identger;

 * postgresql://postgres:***@localhost:5432/postgres
13 rows affected.

[('João da Silva', '3.456', 'Finanças'),
 ('Ana Pereira', '4.567', 'Marketing'),
 ('Beatriz Oliveira', '5.678', 'Vendas'),
 ('Daniela Costa', '6.789', 'Produção'),
 ('Eduardo Santos', '7.890', 'Pesquisa e Desenvolvimento'),
 ('Fernanda Lima', '8.901', 'Logística'),
 ('Gustavo Almeida', '9.012', 'Compras'),
 ('Helena Ferreira', '10.123', 'Atendimento ao Cliente'),
 ('Igor Mendes', '11.234', 'Jurídico'),
 ('Juliana Martins', '12.345', 'Administração'),
 ('Leonardo Rodrigues', '13.456', 'Qualidade'),
 ('Mariana Gomes', '14.567', 'Planejamento'),
 ('Nelson Barros', '15.678', 'Suprimentos')]

### 12. Listar os nomes dos empregados, assim como os departamentos onde trabalham, que ganham mais do que qualquer empregado do departamento de nome *Pesquisa*

In [ ]:
%%sql

select e.nome as "Nome do Empregado", d.nome as "Nome do Departamento"
from empregado as e
inner join departamento as d on e.depnum = d.Num
where e.sal > (select e2.sal
              from empregado as e2
              inner join departamento as d2 on e2.depnum = d2.num
              where d2.nome = 'Pesquisa e Desenvolvimento')
;

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[('Carlos Andrade', 'Finanças'),
 ('Helena Ferreira', 'Compras'),
 ('Nelson Barros', 'Planejamento')]

### 13. Listar os nomes dos empregados que trabalham o mesmo total de horas em algum projeto em que o empregado Caetano Veloso trabalha

In [ ]:
%%sql

select e.nome as "Nome do Empregado", p.nome as "Nome do Pojeto", t.hrs as "Quant. de Horas"
from empregado as e
inner join trabalhando as t on e.ident = t.identemp
inner join projeto as p on t.projnum = p.num
where t.hrs = (select t2.HRS
                from trabalhando as t2
                inner join empregado as e2 on t2.identemp = e2.Ident
                where e2.nome = 'Carlos Andrade')
;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('Carlos Andrade', 'Projeto Gama', '42.0')]

### 14. Quais empregados ganham o maior salário? Listar identidade, nome e salário.

In [ ]:
%%sql

WITH Maiores_Salario_Departamento AS (SELECT e.ident, e.nome, e.sal, d.nome AS departamento,
                                      ROW_NUMBER() OVER (PARTITION BY d.num ORDER BY e.sal DESC) AS rank
                                      FROM empregado AS e
                                      INNER JOIN departamento AS d ON e.depnum = d.num)

SELECT ident, nome, sal, departamento
FROM Maiores_Salario_Departamento
WHERE rank = 1;

 * postgresql://postgres:***@localhost:5432/postgres
15 rows affected.

[('312.864.975', 'Igor Mendes', 3900.0, 'Atendimento ao Cliente'),
 ('975.312.864', 'Juliana Martins', 4800.0, 'Jurídico'),
 ('123.456.789', 'João da Silva', 5000.0, 'Recursos Humanos'),
 ('486.159.753', 'Leonardo Rodrigues', 5100.0, 'Administração'),
 ('531.642.879', 'Mariana Gomes', 4300.0, 'Qualidade'),
 ('642.879.531', 'Nelson Barros', 6500.0, 'Planejamento'),
 ('879.531.642', 'Olivia Azevedo', 4600.0, 'Suprimentos'),
 ('987.654.321', 'Ana Pereira', 4500.0, 'Tecnologia da Informação'),
 ('456.123.789', 'Carlos Andrade', 6200.0, 'Finanças'),
 ('789.321.654', 'Beatriz Oliveira', 3800.0, 'Marketing'),
 ('321.654.987', 'Daniela Costa', 5300.0, 'Vendas'),
 ('654.987.123', 'Eduardo Santos', 4200.0, 'Produção'),
 ('159.753.486', 'Fernanda Lima', 5600.0, 'Pesquisa e Desenvolvimento'),
 ('753.159.864', 'Gustavo Almeida', 4700.0, 'Logística'),
 ('864.975.312', 'Helena Ferreira', 6000.0, 'Compras')]

### 15. Quais os nomes dos empregados que ganham os 3 maiores salários da empresa?

In [ ]:
%%sql

WITH Maiores_Salarios AS (SELECT e.ident, e.nome, e.sal,
                        ROW_NUMBER() OVER (ORDER BY e.sal DESC) AS rank
                        FROM empregado AS e)
SELECT ident, nome, sal
FROM Maiores_Salarios
WHERE rank <= 3;

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[('642.879.531', 'Nelson Barros', 6500.0),
 ('456.123.789', 'Carlos Andrade', 6200.0),
 ('864.975.312', 'Helena Ferreira', 6000.0)]

# OUTRAS e NOVAS CONSULTAS podem ser propostas para prática de SQL nesta Sprint.

⚡ **Fiquem atentos ao Discord!**  ⚡

# Seguem, abaixo, as células com as consultas resolvidas!


---


❗**NÃO OLHAR ANTES de TENTAR FAZER** ❗

In [ ]:
#1 Listar todos os Números dos projetos e os respectivos Números de departamentos que os controlam.
%%sql
SELECT Num AS NumProjeto, DepNum as NumDeptoControlador
FROM Projeto

In [ ]:
#2 Listar todos os Números e Nomes dos projetos, e os respectivos Números e Nomes de departamentos que os controlam.
%%sql
SELECT P.Num AS NumProjeto, P.Nome as NomeProjeto, D.Num as NumDepto, D.Nome as NomeDepto
FROM Projeto P INNER JOIN Departamento D
ON P.Depnum = D.Num

In [ ]:
#3 Exibir o nome e grau de parentesco dos dependentes juntamente com a identidade e nome dos empregados dos quais dependem.
%%sql
SELECT Depe.Nome, Parentesco, Ident, Emp.Nome
FROM DEPENDENTE as Depe INNER JOIN EMPREGADO as Emp
ON IdentEmp = Ident;

In [ ]:
#4 Para cada empregado, mostrar seu nome e sexo, e a identidade e nome do seu superior imediato.
%%sql
SELECT E.Nome as NomeEmpregado, E.Sexo as SexoEmpregado, S.Ident as IdentSuperior, S.Nome as SexoSuperior
FROM EMPREGADO as E INNER JOIN EMPREGADO as S
ON E.SUPERIDENT= S.IDENT;

In [ ]:
#4 Solução alternativa com JOIN a la SQL2
%%sql
SELECT E.Ident as IdentSuper, E.NOME as NomeSuper, S.NOME as NomeSub, S.SEXO as SexoSub
FROM EMPREGADO as E, EMPREGADO as S
WHERE E.SUPERIDENT= S.IDENT;

In [ ]:
#5 Listar os diferentes valores de salários pagos aos empregados da empresa.
%%sql
SELECT DISTINCT Sal
FROM EMPREGADO;

In [ ]:
#6 Quais os nomes dos empregados que trabalham menos de 20 horas por semana em algum projeto?
%%sql
SELECT DISTINCT Nome
FROM EMPREGADO INNER JOIN TRABALHANO
ON Ident = IdentEmp
WHERE HRS < 20;

In [ ]:
#7 Apresentar os nomes de todos os empregados que não têm dependentes.
%%sql
SELECT nome
FROM empregado
WHERE ident NOT IN
  (SELECT identEmp
   FROM   Dependente)

In [ ]:
#8 Quais empregados tem cargos de chefia, isto é, não têm superior imediato?
%%sql
SELECT nome
FROM empregado
WHERE superident is NULL

In [ ]:
#9 Listar todos os locais onde se encontram departamentos da empresa ou onde são realizados projetos.
%%sql
( SELECT	Local 	FROM		PROJETO )
UNION  -- ou UNION ALL
( SELECT	Local 	FROM		DEPLOC )

In [ ]:
#10 Apresentar o resultado dos salários dos empregados que trabalham no projeto “Reengenharia” caso fosse dado um aumento de 10%.
%%sql
SELECT	EMPREGADO.NOME, 1.1*SAL AS SALARIOmais10porcento
FROM 		EMPREGADO, TRABALHANO, PROJETO
WHERE 	EMPREGADO.IDENT = TRABALHANO.IDENTEMP
AND 		TRABALHANO.PROJNUM = PROJETO.NUM
AND 		PROJETO.NOME = 'Reengenharia';

In [ ]:
#11 Quais os nomes dos empregados e os números de departamento dos quais eles são gerentes, se o forem?
%%sql
SELECT Distinct E.nome, D.num as "Numero se for gerente"
FROM 		        Departamento D RIGHT OUTER JOIN Empregado E
ON 		          E.Ident = D.IdentGer
ORDER BY 	      E.nome

In [ ]:
#12 	Listar os nomes dos empregados, assim como os departamentos onde trabalham, que ganham mais do que qualquer empregado do departamento de nome “Pesquisa”
%%sql
SELECT 	E.nome AS NomeEmp, D.nome AS NomeDepto
FROM		empregado E INNER JOIN departamento D
ON 	    E.depnum = D.num
AND 		sal >ALL
            (
              SELECT sal
						  FROM    empregado E INNER JOIN departamento D
						  ON      E.depnum = D.num
              AND 		D.nome = 'Pesquisa'
            )

In [ ]:
#13 Listar os nomes dos empregados que trabalham o mesmo total de horas em algum projeto em que o empregado Caetano Veloso trabalha
%%sql
SELECT 	DISTINCT Nome
FROM 		Trabalhano T1, Empregado E1
WHERE 	T1.IdentEmp = E1.Ident
AND		  E1.Nome <> 'Caetano Veloso'
AND 		EXISTS
    (
      SELECT ProjNum, HRS
		 	FROM Trabalhano T2, Empregado E2
		 	WHERE T2.IdentEmp = E2.Ident
		 	AND E2.Nome = 'Caetano Veloso'
		 	AND T2.ProjNum = T1.ProjNum
		 	AND T2.HRS = T1.HRS
    )

In [ ]:
#14 Quais empregados ganham o maior salário? Listar identidade, nome e salário.
%%sql
SELECT ident, nome, sal
FROM   empregado
WHERE  sal IN
  (
    SELECT max(sal)
    FROM   empregado
  )

In [ ]:
#15 Quais os nomes dos empregados que ganham os 3 maiores salários da empresa?
# solução 1: força bruta ...
%%sql
SELECT ident, nome, sal
FROM empregado
WHERE sal IN
    (SELECT MAX(sal)
     FROM empregado)
OR sal IN
    (SELECT MAX(sal)
     FROM empregado
     WHERE sal NOT IN
        (SELECT MAX(sal)
         FROM empregado))
OR sal IN
    (SELECT MAX(sal)
     FROM empregado
     WHERE sal NOT IN
        (SELECT MAX(sal)
         FROM empregado)
    AND sal NOT IN
        (SELECT MAX(sal)
         FROM empregado
         WHERE sal NOT IN
             (SELECT MAX(sal)
              FROM empregado)))
ORDER BY sal desc

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[('642.879.531', 'Nelson Barros', 6500.0),
 ('456.123.789', 'Carlos Andrade', 6200.0),
 ('864.975.312', 'Helena Ferreira', 6000.0)]

In [ ]:
#15 Solução alternativa e mais elegante: se quiser os 5 maiores,
## basta substituir 3 por 5
%%sql
SELECT ident, nome, sal
FROM   empregado e1
WHERE  3 >
  (
    SELECT count (distinct SAL)
		FROM   empregado e2
		WHERE  e2.sal > e1.sal
  )
ORDER BY sal desc